namespace Kogane
{
    /// <summary>
    /// 読み込んだオブジェクトの参照カウンタを読み取り専用で公開するためのインターフェイス
    /// </summary>
    public interface IReadOnlyLoadObjectReferenceData
    {
        //================================================================================
        // プロパティ
        //================================================================================
        string Path   { get; } // 読み込んだオブジェクトのパス
        int    Count  { get; } // オブジェクトを参照しているハンドルの数
        bool   IsDone { get; } // すでに読み込みが完了している場合 true
    }
}